flight/src/xml/AuthUserRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:flig="http://jawxs.flightservice.kth.se/jaxws/flightbookingprocess">
   <soapenv:Header/>
   <soapenv:Body>
      <flig:authUser>
         <!--Optional:-->
         <arg0>Alex</arg0>
         <!--Optional:-->
         <arg1>654321</arg1>
      </flig:authUser>
   </soapenv:Body>
</soapenv:Envelope>